<?php

return [
    'system' => [
        'registered' => 'Пользователь успешно зарегистрирован',
        'logged_in' => 'Пользователь успешно авторизован',
        'validation' => 'Проверьте правильность введенных данных',
        'system_error' => 'Возникла ошибка на сервере. Пожалуйста, попробуйте еще раз позже.',
        'unauthorized' => 'Вы не авторизованы',
    ],
    'users' => [
        'register' => [
            'email' => [
                'required' => 'Поле email обязательно для заполнения',
                'email' => 'Поле email должно быть валидным email адресом',
                'unique' => 'Пользователь с таким email уже существует',
            ],
            'phone' => [
                'required' => 'Поле телефон обязательно для заполнения',
                'unique' => 'Пользователь с таким телефоном уже существует',
            ],
            'password' => [
                'required' => 'Поле пароль обязательно для заполнения',
                'min' => 'Поле пароль должно быть не менее 8 символов',
                'confirmed' => 'Пароли не совпадают',
            ],
            'agreement' => [
                'required' => 'Поле согласие обязательно для заполнения',
                'accepted' => 'Поле согласие должно быть принято',
            ],
            'success' => 'Вы успешно зарегистрировались!',
        ],
        'login' => [
            'email' => [
                'required' => 'Поле email обязательно для заполнения',
                'email' => 'Поле email должно быть валидным email адресом',
            ],
            'password' => [
                'required' => 'Поле пароль обязательно для заполнения',
                'min' => 'Поле пароль должно быть не менее 8 символов',
            ],
            'unauthorized' => 'Вы ввели неверный номер телефона или пароль',
            'success' => 'Вы успешно авторизовались!',
            'user_info' => 'Информация о пользователе',
        ],
        'logout' => 'Вы успешно вышли из системы!'
    ]
];
