<?php

return [
    'validation' => 'Проверьте правильность введенных данных',
    'users' => [
        'register' => [
            'email' => [
                'required' => 'Поле email обязательно для заполнения',
                'email' => 'Поле email должно быть валидным email адресом',
                'unique' => 'Пользователь с таким email уже существует',
            ],
            'password' => [
                'required' => 'Поле пароль обязательно для заполнения',
                'min' => 'Поле пароль должно быть не менее 8 символов',
                'confirmed' => 'Пароли не совпадают',
            ],
            'agreement' => [
                'required' => 'Поле согласие обязательно для заполнения',
                'accepted' => 'Поле согласие должно быть принято',
            ]
        ],
        'login' => [
            'email' => [
                'required' => 'Поле email обязательно для заполнения',
                'email' => 'Поле email должно быть валидным email адресом',
            ],
            'password' => [
                'required' => 'Поле пароль обязательно для заполнения',
                'min' => 'Поле пароль должно быть не менее 8 символов',
            ]
        ]
    ]
];
