<?php

return [
    'validation' => 'Енгізілген деректердің дұрыс емесін тексеріңіз',
    'users' => [
        'register' => [
            'email' => [
                'required' => 'Электрондық пошта өрісі қажет',
                'email' => 'Электрондық пошта өрісінің мәні дұрыс емес',
                'unique' => 'Бұл электрондық пошта бар',
            ],
            'password' => [
                'required' => 'Құпия сөз өрісі қажет',
                'min' => 'Құпия сөз өрісінің мәні 8 таңбадан аз болмауы керек',
                'confirmed' => 'Құпия сөздер сәйкес келмейді',
            ],
            'agreement' => [
                'required' => 'Құпия сөзді растау өрісі қажет',
                'accepted' => 'Құпия сөзді растау өрісін растау керек',
            ]
        ],
        'login' => [
            'email' => [
                'required' => 'Электрондық пошта өрісі қажет',
                'email' => 'Электрондық пошта өрісінің мәні дұрыс емес',
            ],
            'password' => [
                'required' => 'Құпия сөз өрісі қажет',
                'min' => 'Құпия сөз өрісінің мәні 8 таңбадан аз болмауы керек',
            ]
        ]
    ]
];
