<?php

return [
    'validation' => 'Енгізілген деректердің дұрыс емесін тексеріңіз',
    'users' => [
        'register' => [
            'email.required' => 'Электрондық пошта өрісі қажет',
            'email.email' => 'Электрондық пошта өрісінің мәні дұрыс емес',
            'email.unique' => 'Бұл электрондық пошта бар',
            'password.required' => 'Құпия сөз өрісі қажет',
            'password.min' => 'Құпия сөз өрісінің мәні 8 таңбадан аз болмауы керек',
            'password.confirmed' => 'Құпия сөздер сәйкес келмейді',
        ],
        'login' => [
            'email.required' => 'Электрондық пошта өрісі қажет',
            'email.email' => 'Электрондық пошта өрісінің мәні дұрыс емес',
            'password.required' => 'Құпия сөз өрісі қажет',
            'password.min' => 'Құпия сөз өрісінің мәні 8 таңбадан аз болмауы керек',
        ]
    ]
];
